// Даны два слова. Для каждой буквы первого слова определить, входит ли она во второе слово. Повторяющиеся буквы первого слова не рассматривать.

Console.Write("Введите первое слово: ");
string word1 = Console.ReadLine();

Console.Write("Введите второе слово: ");
string word2 = Console.ReadLine();


